Revit 2024 API
IUpdater.GetAdditionalInformation Method
 Auxiliary text that Revit will use to inform the end user when the Updater is not loaded
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
string GetAdditionalInformation()
Visual Basic
Function GetAdditionalInformation As String
Visual C++
String^ GetAdditionalInformation()
See Also
IUpdater Interface
Autodesk.Revit.DB Namespace